export type Blog = {
  id: string;
  image: string;
  title: string;
  description: string;
  content: string;
  date: string;
};

export const BLOGS: Blog[] = [
  {
    id: '1',
    image: '/assets/blog/Image (1).svg',
    title: 'دليل شامل للعناية اليومية بالبشرة',
    description: 'تعرف على أهم الخطوات اليومية للحفاظ على صحة ونضارة بشرتك.',
    content: 'المحتوى الكامل للمقال هنا...',
    date: 'منذ 5 أيام',
  },
  {
    id: '2',
    image: '/assets/blog/Image (2).svg',
    title: 'أفضل المكونات الطبيعية لبشرة نضرة',
    description: 'اكتشف فوائد المكونات الطبيعية وكيفية استخدامها بشكل صحيح.',
    content: 'المحتوى الكامل للمقال هنا...',
    date: 'منذ 6 أيام',
  },
  {
    id: '3',
    image: '/assets/blog/Image (3).svg',
    title: 'كيف تتخلص من حب الشباب نهائيًا',
    description: 'نصائح طبية فعالة للتعامل مع حب الشباب ومنع ظهوره.',
    content: 'المحتوى الكامل للمقال هنا...',
    date: 'منذ أسبوع',
  },
  {
    id: '4',
    image: '/assets/blog/Image.svg',
    title: 'روتين الصباح المثالي لبشرة مشرقة',
    description: 'ابدأ يومك بروتين بسيط يساعدك على إشراقة تدوم طوال اليوم.',
    content: 'المحتوى الكامل للمقال هنا...',
    date: 'منذ أسبوعين',
  },
  {
    id: '5',
    image: '/assets/blog/Image (1).svg',
    title: 'دليل شامل للعناية اليومية بالصحه النفسية',
    description: 'تعرف على أهم الخطوات اليومية للحفاظ على صحة ونضارة بشرتك.',
    content: 'المحتوى الكامل للمقال هنا.................',
    date: 'منذ  شهر',
  },
  {
    id: '6',
    image: '/assets/blog/Image.svg',
    title: 'روتين الصباح المثالي لبشرة مشرقة',
    description: 'ابدأ يومك بروتين بسيط يساعدك على إشراقة تدوم طوال اليوم.',
    content: 'في عام 2026، ينصح الخبراء بالابتعاد عن الروتين المعقد والتركيز على ثلاث ركائز: التنظيف بمنظف لطيف مرتين يومياً، والترطيب بمنتجات تحتوي على السيراميد أو الهيالورونيك، والحماية من الشمس والضوء الأزرق كخط دفاع أساسي ضد الشيخوخة.',
    date: 'منذ أسبوعين',
  },
  {
    id: '10',
    image: '/assets/blog/Image.svg',
    title: 'روتين الصباح المثالي لبشرة مشرقة',
    description: 'ابدأ يومك بروتين بسيط يساعدك على إشراقة تدوم طوال اليوم.',
    content: 'المحتوى الكامل للمقال هنا...',
    date: 'منذ أسبوعين',
  },
];
